'''
有一个列表，[“北京”,”上海”,”广东”]
1)将中国所有省会城市添加到上述列表中



2)广东成为第二大发达城市，将广东排在上海前面
1.删除广东   li.remove(“广东”)
2.添加  li.insert(1,”广东”)


3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
'''

city = ["北京","上海","广东"]
# 1)将中国所有省会城市添加到上述列表中
# 添加城市
city.extend(["天津","重庆","哈尔滨","长春","沈阳","呼和浩特","石家庄","乌鲁木齐","兰州","西宁","西安","银川","郑州","济南","太原",
            "合肥","长沙","武汉","南京","成都","贵阳","昆明","南宁","拉萨","杭州","南昌","广州","福州","台北","海口","香港","澳门"])

print(city)

# 2)广东成为第二大发达城市，将广东排在上海前面
# 1.删除广东   li.remove(“广东”)
# 2.添加  li.insert(1,”广东”)

city.remove("广东")
city.insert(1,"广东")

print(city)

#3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，
# 请统计前8城市的GDP总和，平均GDP。

gdp = [36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
sum = sum(gdp)
avg1 = sum/8
print("前8城市的GDP总和为：",sum)
print("前8城市的平均GDP为：",avg1)

